balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ128GB108.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnn-" edc:cname="CNPD4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="CNPD4" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN49PDE" edc:desc="" edc:mask="0x1" edc:name="CN49PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN50PDE" edc:desc="" edc:mask="0x1" edc:name="CN50PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN51PDE" edc:desc="" edc:mask="0x1" edc:name="CN51PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN52PDE" edc:desc="" edc:mask="0x1" edc:name="CN52PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN53PDE" edc:desc="" edc:mask="0x1" edc:name="CN53PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN54PDE" edc:desc="" edc:mask="0x1" edc:name="CN54PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN55PDE" edc:desc="" edc:mask="0x1" edc:name="CN55PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN56PDE" edc:desc="" edc:mask="0x1" edc:name="CN56PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN57PDE" edc:desc="" edc:mask="0x1" edc:name="CN57PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN58PDE" edc:desc="" edc:mask="0x1" edc:name="CN58PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN59PDE" edc:desc="" edc:mask="0x1" edc:name="CN59PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN60PDE" edc:desc="" edc:mask="0x1" edc:name="CN60PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN61PDE" edc:desc="" edc:mask="0x1" edc:name="CN61PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN62PDE" edc:desc="" edc:mask="0x1" edc:name="CN62PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN63PDE" edc:desc="" edc:mask="0x1" edc:name="CN63PDE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nn--n--nnnnnnnn" edc:cname="CNPD5" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-00--0--00000000" edc:name="CNPD5" edc:nzwidth="0x10" edc:por="-00--0--00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN64PDE" edc:desc="" edc:mask="0x1" edc:name="CN64PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN65PDE" edc:desc="" edc:mask="0x1" edc:name="CN65PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN66PDE" edc:desc="" edc:mask="0x1" edc:name="CN66PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN67PDE" edc:desc="" edc:mask="0x1" edc:name="CN67PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN68PDE" edc:desc="" edc:mask="0x1" edc:name="CN68PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN69PDE" edc:desc="" edc:mask="0x1" edc:name="CN69PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN70PDE" edc:desc="" edc:mask="0x1" edc:name="CN70PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN71PDE" edc:desc="" edc:mask="0x1" edc:name="CN71PDE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN74PDE" edc:desc="" edc:mask="0x1" edc:name="CN74PDE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CN77PDE" edc:desc="" edc:mask="0x1" edc:name="CN77PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN78PDE" edc:desc="" edc:mask="0x1" edc:name="CN78PDE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CNEN1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="CNEN1" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN0IE" edc:desc="" edc:mask="0x1" edc:name="CN0IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN1IE" edc:desc="" edc:mask="0x1" edc:name="CN1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN2IE" edc:desc="" edc:mask="0x1" edc:name="CN2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN3IE" edc:desc="" edc:mask="0x1" edc:name="CN3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN4IE" edc:desc="" edc:mask="0x1" edc:name="CN4IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN5IE" edc:desc="" edc:mask="0x1" edc:name="CN5IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN6IE" edc:desc="" edc:mask="0x1" edc:name="CN6IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN7IE" edc:desc="" edc:mask="0x1" edc:name="CN7IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN8IE" edc:desc="" edc:mask="0x1" edc:name="CN8IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN9IE" edc:desc="" edc:mask="0x1" edc:name="CN9IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN10IE" edc:desc="" edc:mask="0x1" edc:name="CN10IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN11IE" edc:desc="" edc:mask="0x1" edc:name="CN11IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN12IE" edc:desc="" edc:mask="0x1" edc:name="CN12IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN13IE" edc:desc="" edc:mask="0x1" edc:name="CN13IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN14IE" edc:desc="" edc:mask="0x1" edc:name="CN14IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN15IE" edc:desc="" edc:mask="0x1" edc:name="CN15IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CNEN2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="CNEN2" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN16IE" edc:desc="" edc:mask="0x1" edc:name="CN16IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN17IE" edc:desc="" edc:mask="0x1" edc:name="CN17IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN18IE" edc:desc="" edc:mask="0x1" edc:name="CN18IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN19IE" edc:desc="" edc:mask="0x1" edc:name="CN19IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN20IE" edc:desc="" edc:mask="0x1" edc:name="CN20IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN21IE" edc:desc="" edc:mask="0x1" edc:name="CN21IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN22IE" edc:desc="" edc:mask="0x1" edc:name="CN22IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN23IE" edc:desc="" edc:mask="0x1" edc:name="CN23IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN24IE" edc:desc="" edc:mask="0x1" edc:name="CN24IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN25IE" edc:desc="" edc:mask="0x1" edc:name="CN25IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN26IE" edc:desc="" edc:mask="0x1" edc:name="CN26IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN27IE" edc:desc="" edc:mask="0x1" edc:name="CN27IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN28IE" edc:desc="" edc:mask="0x1" edc:name="CN28IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN29IE" edc:desc="" edc:mask="0x1" edc:name="CN29IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN30IE" edc:desc="" edc:mask="0x1" edc:name="CN30IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN31IE" edc:desc="" edc:mask="0x1" edc:name="CN31IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-nnnnn--------n" edc:cname="CNEN3" edc:desc="" edc:impl="0xbe01" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00000--------0" edc:name="CNEN3" edc:nzwidth="0x10" edc:por="0-00000--------0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN32IE" edc:desc="" edc:mask="0x1" edc:name="CN32IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="CN41IE" edc:desc="" edc:mask="0x1" edc:name="CN41IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN42IE" edc:desc="" edc:mask="0x1" edc:name="CN42IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN43IE" edc:desc="" edc:mask="0x1" edc:name="CN43IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN44IE" edc:desc="" edc:mask="0x1" edc:name="CN44IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN45IE" edc:desc="" edc:mask="0x1" edc:name="CN45IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN47IE" edc:desc="" edc:mask="0x1" edc:name="CN47IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnn-" edc:cname="CNEN4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000000000-" edc:name="CNEN4" edc:nzwidth="0x10" edc:por="000000000000000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN49IE" edc:desc="" edc:mask="0x1" edc:name="CN49IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN50IE" edc:desc="" edc:mask="0x1" edc:name="CN50IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN51IE" edc:desc="" edc:mask="0x1" edc:name="CN51IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN52IE" edc:desc="" edc:mask="0x1" edc:name="CN52IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN53IE" edc:desc="" edc:mask="0x1" edc:name="CN53IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN54IE" edc:desc="" edc:mask="0x1" edc:name="CN54IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN55IE" edc:desc="" edc:mask="0x1" edc:name="CN55IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN56IE" edc:desc="" edc:mask="0x1" edc:name="CN56IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN57IE" edc:desc="" edc:mask="0x1" edc:name="CN57IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN58IE" edc:desc="" edc:mask="0x1" edc:name="CN58IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN59IE" edc:desc="" edc:mask="0x1" edc:name="CN59IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN60IE" edc:desc="" edc:mask="0x1" edc:name="CN60IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN61IE" edc:desc="" edc:mask="0x1" edc:name="CN61IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN62IE" edc:desc="" edc:mask="0x1" edc:name="CN62IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN63IE" edc:desc="" edc:mask="0x1" edc:name="CN63IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
